In [1]:
import pandas as pd 

import numpy as np

In [2]:
import pandas as pd

a = pd.read_csv('C:/Users/pau_a/Documents de Paula en disco/Notebooks/notebook_uno/ds_salaries.csv')

In [3]:
int(a.duplicated().sum())

1171

In [4]:
duplicados=pd.DataFrame(a.value_counts())
duplicados[duplicados['count']>1]

                                                                                                                                                                  count
work_year experience_level employment_type job_title          salary salary_currency salary_in_usd employee_residence remote_ratio company_location company_size
2022      SE               FT              Data Scientist     191475 USD             191475        US                 100          US               M                21
                                                              141525 USD             141525        US                 100          US               M                21
2023      SE               FT              Data Engineer      129000 USD             129000        US                 0            US               M                13
                                                              252000 USD             252000        US                 0            US               M                13
2022      SE               FT              Data Scientist     129300 USD             129300        US                 0            US               M                12
...                                                                                                                                                                 ...
2023      SE               FT              Research Scientist 169200 USD             169200        ES                 0            ES               M                 2
2022      SE               FT              Data Analyst       110925 USD             110925        US                 100          US               M                 2
                                           Data Engineer      195700 USD             195700        US                 0            US               M                 2
                                           Data Scientist     230000 USD             230000        US                 100          US               M                 2
2023      SE               FT              Research Scientist 253750 USD             253750        ES                 0            ES               M                 2

[544 rows x 1 columns]

In [5]:
a.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [6]:
a.duplicated().sum()

np.int64(1171)

In [7]:
a.drop_duplicates(inplace=True) #eliminar duplicados

¿de que pais son la mayoria de compañias?

In [8]:
country_counts = a['company_location'].value_counts()
most_frequent_country = country_counts.index[0]
most_frequent_count = country_counts.iloc[0]

print(f'{most_frequent_country}: {most_frequent_count}')

US: 1929